Revit 2024 API
Railing.SetMultistoryStairsPlacementLevels Method
 Sets the ids of the base levels of the stairs upon which this railing is placed.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void SetMultistoryStairsPlacementLevels(
	ISet<ElementId> levelIds
)
Visual Basic
Public Sub SetMultistoryStairsPlacementLevels ( _
	levelIds As ISet(Of ElementId) _
)
Visual C++
public:
void SetMultistoryStairsPlacementLevels(
	ISet<ElementId^>^ levelIds
)
Parameters
levelIds
Type: System.Collections.Generic.ISet<ElementId>
 The ids of levels the railing is placed on. If input level id set is empty, railings will placed on all levels of the hosting stairs.
Remarks
 The method is valid only for railings hosted by stairs in MultistoryStairs. The input level ids have to be a subset of level ids of the railing stairs. See MultistoryStairs for information about the placement levels that may be passed as input.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  All of the level ids in levelIds must be placement levels of stairs.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The railing is not hosted by stairs in MultistoryStairs.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace